////////////////////////////////////////////////////////////                  1 задание 


/* let a = +prompt("Введите свой возраст: ");

if (a <= 18) {
  alert("Вы еще молоды, вам нужно учиться");
} else if (a > 18 && a <= 50) {
  alert("Вам нужно работать");
} else if (a > 50 && a <= 59) {
  alert("Вам пора уже на пенсию");
} else if (a > 59 && a <= 100) {
  alert("Поздравлю вы прошли уровень");
} else {
  alert("ошибка");
}
 */


////////////////////////////////////////////////////////////                  2 задание

/* 
let a = +prompt("Введите время в цифрах: ");

switch (true) {
    case (a <= 6):
    alert(a + " часа ночи")
    break;
    case (a > 7 && a <= 10):
    alert(a + " часов утра")
    break;
    case (a > 11 && a <= 17):
    alert(a + " часа дня")
    break;
    case (a > 18 && a <= 23):
    alert(a + " часов вечера")
    break;
} */



////////////////////////////////////////////////////////////                  3 задание

/* 
var a = +prompt("Введите 1 число");
var b = +prompt("Введите 2 число");
var c = +prompt("Введите 3 число");

var max = Math.max(a, b, c);
var min = Math.min(a, b, c);

var abc = (min + max) / 2;

alert('Среднее число = ' + abc + ',' + ' Max = ' + max + ', ' + ' Min = ' + min); */